{
    "1. Getting Started.docx": "This document outlines the process for tuning Volkswagen Auto Group (VAG) vehicles equipped with Simos 18.1, 18.6, and 18.10 ECUs. The core workflow involves obtaining a stock binary (.bin) tune by converting an FRF file, using a definition file (XDF or XML) to interpret and modify the calibration data with an editor like TunerPro or ecuEdit, and then writing the modified file to the ECU using a flashing tool such as VW_Flash or the SimosTools Android app. Key technical concepts include the binary file structure (CAL, ASW), the function of definition files, and the use of specific hardware dongles like the Tactrix OpenPort or Macchina A0 for flashing and datalogging.",
    "10_CHRG-Charger": "This technical document details the configuration data for the CHRG (Charger) software module, specifically for the VW SIMOS 18.1 EA888 engine control unit (ECU) by Continental. Its core purpose is to define the calibration and configuration parameters that control the engine's forced induction system, including flags for selecting turbochargers or superchargers and enabling features like a recirculation valve (RCL). A key technical concept is the extensive list of `NC_NR_LEN_` parameters, which specify the number of breakpoints used to define the size of the ECU's internal 1D and 2D calibration maps for functions such as boost pressure control, charge air temperature modeling, and turbine control.",
    "11_CUSF-Customer_Supplied_Functions": "This document specifies the 'Customer Supplied Functions' (CUSF) software module for the Volkswagen (VW) SIMOS 18.1 engine control unit on the EA888 engine platform. The core purpose of this module is to perform customer-requested calculations to generate specific system variables for engine control, diagnostics, and communication. Key technical concepts described include the calculation of variables such as time after start for OBD (`T_AST_OBD`), filtered torque request gradient (`TQI_SP_MAF_GRD_MMV`), driver pedal request for CAN output (`LV_PV_CT`), and the state of the maximum engine speed display for the instrument cluster (`STATE_N_MAX_DISP_CAN`) during limp-home conditions, all executed within different real-time recurrence tasks (1s, 100ms, 10ms).",
    "12_CYBL-Cylinder_balancing": "This technical document specifies the Cylinder Balancing (CYBL) function for the VW SIMOS 18.1 EA888 engine control unit, designed to achieve smooth engine operation by equalizing torque output across individual cylinders. The core technical concept involves correcting cylinder-specific injection times (TI intervention) based on engine roughness calculations. The system uses a state machine to manage both additive and multiplicative adaptation factors, which adjust injector characteristics at different mass fuel flow rates. The document details extensive configuration data and calibration parameters that define the function's operating ranges (e.g., low/high load, idle), enable conditions, and support for various vehicle setups like different gear types and cylinder banks.",
    "13_DGNC-Diagnostic_communication": "This technical document specifies the diagnostic communication (DGNC) functionality for the Continental VW SIMOS 18.1 ECU for the EA888 engine. It details the implementation of the UDS (ISO 14229) and KWP2000 (VDA 14230-3) diagnostic protocols over a CAN datalink, referencing key ISO standards like 15765. The content covers the layered protocol architecture, including basic communication and service interpreters, and provides an extensive list of Measured Value Blocks (MVBs), which are specific real-time data signals and parameters available for diagnostics.",
    "14_DRPD-Driver_request_pedals_determination": "This technical document specifies the DRPD (Driver Request Pedals Determination) software module for the VW SIMOS 18.1 EA888 engine control unit. Its core purpose is to process and interpret signals from driver-operated pedals, primarily the accelerator pedal sensor (PVS), to calculate a definitive driver request value (PV_AV) and its gradient. The document details extensive hardware configuration options via constants (NC_...) for different sensor types (Hall, Potentiometer, SENT), describes signal processing steps like filtering and value calculation, and outlines a robust error handling and plausibility system that uses permission signals based on an Error Manager (ERRM) and cross-checks with brake signals (BLS/BTS).",
    "15_DRRQ-Driver_request": "This document details software functions within the VW SIMOS 18.1 engine control unit for the EA888 engine, focusing on the \"Driver Request\" (DRRQ) module. The core purpose is twofold: first, to interpret the driver's accelerator pedal input and calculate the corresponding torque request at the clutch and wheels (`TQ_WHL_DRIV_REQ`), with specific logic branches for conventional combustion (`NC_PT_TYP_CMB_ENG`) and hybrid (`LV_VAR_HYB`) powertrains. Second, it describes the \"Adaptive drive dynamics\" function, which manages the dynamic switching of the Variable Valve Lift (VVL) system by using a wide range of vehicle inputs (speed, temperature, transmission state, etc.) to inhibit or modify VVL switch events, ensuring smooth drivability and appropriate engine response.",
    "16_DRVB-Driveability": "This technical document specifies the Driveability (DRVB) module, with a primary focus on the anti-jerk (AJ) function, for the Continental SIMOS 18.1 engine control unit on VW EA888 engines. It defines the configuration data and extensive calibration parameters, maps, and curves that adapt the anti-jerk controller to mitigate vehicle jerk by applying torque corrections based on engine speed deviations. The core concepts include parameterization for different drivetrain configurations such as automatic (AT), CVT, manual (MT), and 4WD systems, selected through variant coding, to optimize torque response and smoothness.",
    "17_ECM2-ECU_Process_Monitoring": "This document details the ECM2 (Engine Control Module level 2) Process Monitoring Concept for the VW SIMOS 18.1 ECU, a safety system designed to prevent unintended acceleration in the Electronic Throttle Control (ETC) system. It describes a three-level monitoring architecture (Function, Process, and Processor) implemented on a main controller (MC) and an independent monitoring unit (MU). The core of the concept is the Level 2 process monitoring, which validates torque-relevant functions by comparing the actual indicated engine torque against the desired torque derived from driver input and system requests. Key technical features include processor supervision by the MU (Level 3), redundant A/D converter checks, monitoring of numerous sensors and actuators, and a fault reaction mechanism that enables a safe \"limp home\" mode by independently disabling power stages.",
    "18_ECM3-ECU_Processor_Monitoring": "This technical specification details the project-specific configuration data for the ECM3 ECU Processor Monitoring function within the VW SIMOS 18.1 EA888 engine control unit. It focuses on parameters governing the interaction between a Main Controller (MC) and a Monitoring Unit (MU) in a safety-critical architecture. The document defines values for crucial safety mechanisms, including checksum validation for code and calibration, Program Flow Monitoring (PFM), timers and test cycles for MC-MU communication, and the Switch Off Path Check (SOPC) which manages powerstage disable lines for components like injection and throttle.",
    "19_ECME-ECU_Memory": "This technical specification details the NVMY (Non-Volatile Memory) management function for the VW SIMOS 18.1 Engine Control Unit (ECU), designed to provide a common interface for software aggregates to store and restore persistent data such as adaptive values and diagnostic flags. The system organizes data into \"channels,\" which can be grouped, and ensures data integrity through CRC16 checksums and a MASTER/COPY redundancy method. It operates based on key ECU system events: restoring data at startup (NVMRES), storing data at shutdown (NVMSTO), and initializing data to defaults in case of corruption or software updates (NVMINI). The manager is hardware-independent, supporting both EEPROM and FLASH EEPROM emulation, and provides additional functionalities including \"write on fly\" during operation, \"read for diag\" for external tools, and APIs like `ACTION_ECME_ClrNvData` to manage data groups.",
    "1_Introduction": "This technical specification document details the Continental SIMOS 18.1 engine control system for the Volkswagen/Audi EA888 R4 1.8L/2.0L TFSI engine. It provides a system overview, including core engine data and descriptions of key technologies such as continuous variable valve timing (IVVT), variable valve lift (AVS), and a variable port flap system. The document defines the logical (0-3) versus physical (1-4) cylinder numbering, the 1-3-4-2 firing order, and the angular positioning of the crankshaft (CRK) and camshaft (CAM) trigger wheels for engine timing. A major section is dedicated to the detailed ECU pin configuration for SIMOS 18.1/18.2/18.3/18.6/18.7 variants, mapping engine connector pins to specific functions like injectors, sensors, and actuators.",
    "2. SimosTools - Getting Started.docx": "This document is a user guide for the SimosTools Android application, which connects to a vehicle via a compatible OBD2 dongle to perform advanced data logging and ECU flashing. The core purpose is to configure and capture vehicle performance data using customizable Parameter IDs (PIDs) imported from CSV files, with options for different logging modes like Mode22, high-speed Mode3E, and DSG. Key technical concepts include setting up automatic log triggers based on vehicle parameters (e.g., pedal position, boost), viewing real-time data on configurable gauges, and flashing full BIN or partial CAL files to the vehicle's ECU.",
    "20_ECOP-ECU_Operation": "This document describes the ECU State Detection (ECOP) software module for the VW SIMOS 18.1 EA888 Engine Control Unit. The core purpose of this module is to manage the ECU's operational lifecycle and energy consumption by defining and transitioning between various operating states in a state machine. Key technical concepts include tracking states like WAIT, MAIN (fully active), ES_ON (engine stopped), SYN_ON (engine synchronized), and PWL (power-latch for after-run activities), based on inputs such as ignition status, wake-up signals, and crankshaft synchronization. The module generates system events corresponding to state transitions, which are used to trigger and schedule other software functionalities.",
    "21_ECRP-ECU_Reprogramming": "This document is a technical specification for the customer reprogramming (ECRP) of the VW SIMOS 18.1 ECU flash memory. It describes the process of updating segmented software components such as the Customer Boot SW (CBOOT), ECU-SW, and Calibration data, while the core Siemens Boot SW remains non-erasable. The specification details two primary methods: a generic reprogramming concept managed by the existing CBOOT, and a software download concept utilizing a Primary Boot Loader (PBL) to load a Secondary Boot Loader (SBL) into RAM for execution. Key technical concepts include security mechanisms like checksums, coherence checks, and security keys to prevent unauthorized manipulation, and a critical backup mechanism to ensure the CBOOT can be updated safely without bricking the ECU.",
    "22_EGCP-Exhaust_gas_composition": "This technical document specifies the configuration data for the EGCP (Exhaust Gas Composition) module within the Continental-developed VW SIMOS 18.1 engine control unit for the EA888 engine. It details the numerous software parameters (`NC_...`, `NLC_...`) used for configuring, managing, and diagnosing upstream and downstream oxygen/lambda sensors, including both linear (LSL) and binary (LS) types. Key technical concepts covered are the setup of sensor heater PWM frequencies, diagnostic routines for electrical faults (short/open circuits), plausibility checks, sensor dynamics, and the interface with lambda sensor controller ICs (ATICs). The document also defines the data structures for O2 sensor signal acquisition, such as the raw pump current (`IPLSL_RAW`) and sensor voltage (`V_LS`).",
    "23_EGPA-Exhaust_gas_pressure_actuator": "This technical document specifies the software configuration and diagnostics for the Exhaust Gas Pressure Actuator (EGPA) system, specifically within the VW SIMOS 18.1 EA888 engine control unit. The core purpose is to define parameters for controlling single or multiple exhaust flaps, which can be either electrical (PWM-driven) or pneumatic. Key technical concepts include configuring the number and type of flaps, setting operational modes like sport or specific noise profiles, and implementing detailed actuator diagnostics to detect and manage electrical faults such as open circuits (OC), short circuits to ground (SCG), and short circuits to power (SCP) based on feedback signals from the flap's control unit.",
    "24_EGPR-Exhaust_gas_pressure": "This technical document details the EGPR (Exhaust Gas Pressure) software function for the VW SIMOS 18.1 EA888 engine control unit. The core purpose is to calculate the exhaust pressure in the manifold, treating it as a function of engine mass flow and exhaust gas temperature for both turbocharged and non-turbocharged systems. The methodology relies on sensor inputs like MAF or MAP, distinguishes between steady-state and transient operation, and is heavily defined by configuration parameters (NC_...) and interpolation maps (ip-maps). Key technical concepts include the calculation of pressure pre-catalyst (`PRS_EX_PCAT_UP`), pressure quotient at the turbine (`PQ_TUR`), and the application of various filtering constants (`CRLC_...`) and correction factors (`FAC_...`) based on engine speed, temperature, and load.",
    "25_EGRC-Exhaust_Gas_Recirculation": "This technical document describes the software configuration for the Exhaust Gas Recirculation Control (EGRC) module within the VW SIMOS 18.1 engine control unit. Its core purpose is to define the behavior for systems without an external EGR system, managed by the configuration constant `NC_EGR_CONF`. The document specifies that when EGR is inactive, a \"dummy outputs\" module is used to initialize all EGR-related parameters?such as flow rates, spark advance corrections, and diagnostic flags?to neutral zero values to ensure predictable ECU functionality.",
    "26_EGTR-Exhaust_gas_treatment_system": "This technical document describes the exhaust gas treatment (EGTR) system, focusing on the management and diagnosis of the three-way catalyst for the VW SIMOS 18.1 ECU platform. The core of the document details the OBD II compliant catalyst efficiency diagnosis using the \"gap method,\" which relies on forced lambda stimulation?intentionally creating rich and lean air-fuel ratio deviations?to measure the catalyst's Oxygen Storage Capacity (OSC). Key related concepts include the 'Catalyst Purge' function to optimize catalyst conditions after lean operation, the implementation of an EWMA (Exponentially Weighted Moving Average) filter to improve diagnostic robustness across driving cycles, and Rate Based Monitoring (RBM) to ensure regulatory compliance.",
    "27_ENLU-Engine_lubrication": "This document describes the ENLU (Engine Lubrication) software aggregate for the VW SIMOS 18.1 ECU, whose core purpose is to implement the service interval extension (WIV) functionality, calculating the remaining distance to the next oil service. The system processes signals from a thermal oil sensor, acquired either via a direct ECU pin or the CAN bus, to determine oil level, temperature, and calculate oil wear/soot equivalents. Key technical concepts include support for two strategies (WIV3 and WIV4, which differ in the distribution of calculations between the ECU and the instrument cluster), the decoding of the sensor's high/low signal times, performing static and dynamic oil level measurements, generating level warnings, and running electrical and plausibility diagnostics on the sensor. The final data is transmitted to the instrument cluster (ICL) for display.",
    "28_ENOS-Engine_operating_states": "This technical document specifies the ENOS (Engine Operating States) function for the VW SIMOS 18.1 EA888 engine control unit. The core purpose of ENOS is to define the engine's current operational status using a state machine based primarily on engine speed and load. It details the logic and transition conditions between key states: Engine Stopped (ES), Start (ST), Idle Speed (IS), Part Load (PL), Push Trailing Throttle (PU), and Trailing Throttle Fuel Cut Off (PUC). The document outlines the software architecture, scheduling, synchronization constraints, and the specific data definitions, including input signals, timers, hysteresis values, and calibration parameters that govern the state transitions.",
    "29_ENRD-Engine_roughness_determination": "This technical document describes the ENRD (Engine Roughness Determination) system for the VW SIMOS 18.1 engine controller. Its core purpose is to calculate and provide engine roughness information to support functions like misfire monitoring, engine roughness control, and cylinder balancing. The system operates by analyzing crankshaft segment times, which reflect in-cylinder combustion events. Key technical concepts include an adaptive learning process to correct these segment times and compensate for mechanical noise from flywheel tolerances, along with diagnostic functions to validate the data and adaptive values.",
    "2_AIRM-Air_motion": "This technical document specifies the AIRM (Air motion) software function for the VW SIMOS 18.1 EA888 engine control unit, detailing the control logic for intake manifold port flaps. The core purpose is to process sensor feedback to determine the actual flap position and to calculate the desired actuation setpoint. The system calculates the normalized actual flap position (`FAC_PORT_DEAC`) from sensor voltages using adapted end-stop values, averaging them for multi-flap configurations. The desired setpoint (`LV_PORT_DEAC`) is then determined using calibration maps based on primary inputs like engine speed (`N_32`) and load (`MAF_STK_SP_TQI`), with modifications for conditions such as gear, temperature, catalyst heating, and scavenging.",
    "3. ECU Tuning - Basics.docx": "This document is a technical guide for tuning a vehicle's Engine Control Unit (ECU) using TunerPro software with corresponding .bin and .xdf files, specifically for VAG platforms. The core process involves modifying the stock torque-based control system by adjusting key tables such as 'Maximum Torque at Clutch', 'Torque to Airflow' (TTA), and 'Airflow to Torque' (ATT) to manage the relationship between torque request and airmass (mg/stk). It details how to set a target boost curve using either the 'Turbo Max Pressure Ratio' or the preferred 'PUT setpoint' table, and concludes with instructions on wastegate tuning by adjusting its position based on logged intake and exhaust flow factors to align actual boost with the setpoint.",
    "30_ENSC-Engine_speed_control": "This document describes the Engine Speed Control (ENSC) module for the VW SIMOS 18.1 EA888 engine controller. Its core purpose is to calculate and manage the engine speed setpoint. The document details the configuration of ENSC sub-functions via compiler switches (e.g., `NC_CONF_ENSC_ENA_403U`) to adapt behavior for different powertrain types, such as standard combustion versus hybrid systems. Key technical concepts covered include adapting the idle speed controller based on clutch status for manual transmissions and a detailed explanation of the \"Driving off assistance\" (DROF) function, which prevents stalling by using torque precontrol and a dynamic idle speed setpoint (`N_SP_IS_DROF`) based on inputs like pedal value and coolant temperature.",
    "31_ENSD-Engine_position_and_speed_determination": "This technical document specifies the ENSD (Engine position and speed determination) software module for the VW SIMOS 18.1 EA888 engine control unit. Its core purpose is to calculate precise engine position (0-720� CRK), speed, and speed gradient by processing and filtering signals from crankshaft and camshaft sensors. Key technical concepts include a multi-stage synchronization process using sensor target wheel reference gaps and edge patterns, management of stop/start functionality with a CPDD signal, diagnostic routines for sensor faults and backward rotation, and limp-home operational modes. The document details the software architecture, including low-layer signal acquisition and high-layer logic, along with the necessary configuration data to adapt the system to specific engine hardware.",
    "32_ENSL-Engine_speed_limitation": "This document describes the Aggregate Engine Speed Limitation (ENSL) function for the VW SIMOS 18.1 EA888 engine control unit, designed to protect the engine from overspeed, limit vehicle speed, and manage RPM during limp-home modes. The core technical concept involves reducing engine torque via a PI controller using multiple strategies: a \"soft\" mode acting on the air path and a \"hard\" mode which adds ignition intervention and single-cylinder fuel cut-off. A coordination module determines the active speed limit threshold (N_MAX_THD) based on various system triggers, including sensor errors (CRK, CAM), component protection (ETC, VVL), or requests from the TCU, with the final output being torque reduction requests (TQI_N_MAX_SLOW, TQI_N_MAX_FAST) to the torque coordination module.",
    "33_ENSS-Engine_start_and_stop": "This document details the ENSS (Engine Start and Stop) aggregate within the VW SIMOS 18.1 engine management system for EA888 engines. Its core purpose is to manage and coordinate all engine start and stop functionality, including providing the control strategy, known as the StopStart Manager, for automated Stop/Start systems. The ENSS evaluates driver inputs and external requests (e.g., from an airbag or immobilizer) to determine start/stop conditions, while coordinating subsystems like ignition, fuel injection, and the starter (relay or Crankshaft Starter Generator). Key technical concepts include auxiliary start functions that generate status flags (e.g., `LV_STALL`, `T_AST`), specialized strategies for HPDI engines distinguishing between high-pressure (stratified, EOI-phased) and low-pressure (SOI-phased) starts, calculation of engine off duration, and diagnostic plausibility checks, all governed by extensive configuration data.",
    "34_ENTE-Engine_temperature": "This document specifies the ENTE (Engine Temperature) software aggregate for the VW SIMOS 18.1 EA888 engine control unit (ECU), designed to manage the engine's cooling system and optimize thermal efficiency. Its core functions involve acquiring and processing coolant temperature sensor data, implementing OEM thermomanagement strategies to reduce fuel consumption, and controlling peripheral components such as pumps, fans, radiator shutters, and a rotary coolant valve (RVC). Key technical concepts include comprehensive OBDI/OBDII diagnostics for the thermostat and sensors, limp-home management, and detailed electrical and functional diagnoses for the controlled actuators, with specific details on the RVC's position control which utilizes the SENT protocol.",
    "35_ERRM-Error_management": "This technical specification details the Error Management (ERRM) aggregate for the VW SIMOS 18.1 EA888 engine control unit, designed to manage diagnostic failures in compliance with CARB and EOBD regulations. Its core functions include collecting and storing diagnostic information, managing the states of Diagnostic Trouble Codes (DTCs) in dynamic and permanent memory, storing environmental data and freeze frames, controlling the Malfunction Indicator Lamp (MIL), and providing a data interface for external scan tools via standard OBD modes ($01-$0A) and UDS services. The system also handles readiness codes, rate-based monitoring, and coordinates limp-home functionality with the Fault Reaction Manager (FARM).",
    "36_EVAC-Evaporative_system_control": "This document details the EVAC (Evaporative system control) function for the VW SIMOS 18.1 engine management system, which prevents fuel vapor pollution by trapping fuel vapors in an activated charcoal filter (ACF) and purging them into the engine's intake manifold for combustion. The core of the system is the control of a canister purge solenoid (CPS) and the calculation of canister load (CL) based on the resulting lambda controller deviation, mass air flow (MAF), and other sensor inputs. To maintain engine stability, the system predicts the amount of purged fuel and applies a correction to the primary fuel mass or engine torque. The control logic operates through various states (e.g., NO_PURGE, NORMAL_PURGE) and utilizes a time scheduler to deconflict its operation with the lambda adaptation function, as both processes rely on monitoring lambda deviation.",
    "37_EVAM-Evaporative_system_monitoring": "This technical document details the Evaporative System Monitoring (EVAM) function, a software logic on the VW SIMOS 18.1 Engine Control Unit (ECU) designed for on-board diagnostics (OBD) of the fuel vapor system to meet environmental regulations. Its core purpose is to perform two key checks: a tank leak detection test and a plausibility check of the Canister Purge Solenoid (CPS) valve. The primary technical concept for leak detection is the Natural Vacuum Leak Detection (NVLD) method, which uses a pressure switch to monitor the natural vacuum created by temperature drops when the engine is off. The CPS check validates the purge valve's functionality by actuating it and observing the corresponding reaction in engine manifold pressure.",
    "38_EXTC-Exhaust_system_temperature_control": "This document describes the EXTC (Exhaust System Temperature Control) module for the VW SIMOS 18.1 EA888 engine control system, focusing on its two primary functions: component overheating prevention and catalyst heating. To prevent overheating of the catalyst and turbine, the system employs strategies such as inhibiting ignition retardation, enriching the air-fuel mixture (lambda control), and reducing engine torque. For catalyst heating, which ensures rapid light-off and optimal emission control, the system adjusts parameters like torque reserve, air-fuel mixture, and idle speed setpoints. The document also details the extensive configuration data and calibration parameters used to define these control strategies.",
    "39_EXTD-Exhaust_system_temperature_determination": "This document describes EXTD (Exhaust system Temperature Determination), a software aggregate for the VW SIMOS 18.1 ECU responsible for determining temperatures throughout the vehicle's exhaust line. Its core purpose is to provide critical temperature data for component protection (turbine and catalyst overheating), lambda sensor heater management, and catalyst efficiency diagnosis. The system functions through two primary methods: direct measurement via exhaust gas temperature sensors (ADC or PWM types) and a comprehensive physical model that acts as a backup. The architecture is split into four key parts: sensor acquisition, sensor diagnosis (electrical, cold start, gradient faults), dew point detection for lambda sensor activation, and a sophisticated, configurable exhaust gas temperature model composed of sub-models for engine-out, tube, turbine, and catalyst components, which account for operating conditions, cooling, and exothermic reactions.",
    "3_AIRT-Air_temperature": "This technical document describes the AIRT (Air Temperature) software aggregate for the VW SIMOS 18.1 EA888 engine control unit. Its core purpose is to provide the ECU with crucial ambient air temperature (TAA) and intake system temperatures at various points, including the intercooler, throttle (TIG_THR), intake manifold (TIG_IM), and intake valve (TIG_INV). The system's key technical concepts involve three main functions: acquiring temperature data from diverse sensor types (analog, PWM, CAN, SENT); using calibrated temperature models to calculate or estimate temperatures at locations without direct sensors; and performing comprehensive diagnostics to ensure signal validity, including electrical fault detection and sensor plausibility checks. The aggregate is highly configurable to enable or disable specific models and diagnoses based on the vehicle's hardware.",
    "4. ECU Tuning - Not the Basics.docx": "This document is an advanced guide for vehicle ECU tuning using TunerPro software, focusing on performance modifications like hybrid turbos and upgraded fuel systems. It details the process of recalibrating core engine parameters, including disabling torque limiters, establishing an accurate torque-to-airflow model (TTA/ATT) critical for systems like DSG transmissions, and managing boost through PUT setpoints, a Simple Wastegate (SWG) patch, and Boost-By-Gear (BBG) configurations. Key technical concepts also cover the in-depth tuning of the knock detection system by adjusting sensor gain to prevent saturation from mechanical noise, modifying timing, and re-scaling for upgraded MAP/PUT sensors and low-pressure fuel pumps (LPFP).",
    "40_FARM-Fault_reaction_management": "This document describes the FARM (Fault Reaction Management) system for the VW SIMOS 18.1 EA888 platform, which is an implementation of the Autosar FiM (Function Inhibition Manager). Its core purpose is to calculate and provide activation permissions for software functions based on diagnostic states from the ERRM (Error Management) system as well as non-diagnostic \"auxiliary inputs\" like battery voltage or engine state. Other modules query this system via an API, primarily using the `ACTION_FARM_GetPermission` call, to determine if a function is inhibited due to a fault or a temporary condition like an out-of-range battery voltage preventing OBD diagnostics from running.",
    "41_FMSP-Fuel_mass_setpoint": "This document describes the Fuel Mass Setpoint (FMSP) software aggregate for the VW SIMOS 18.1 engine control unit, which calculates the precise fuel mass for injection. Its core function is to determine the basic fuel quantity from the air mass flow to achieve a stoichiometric air/fuel ratio. The system supports multiple port injection (MPI), direct injection (DI), and combined systems, managing various combustion modes like homogeneous and stratified. Key technical concepts include calculating the fuel split for multiple-injection strategies and applying numerous corrections for engine states (cold-start, warm-up), dynamic effects (wall film compensation), fuel quality adaptation, and cylinder-individual adjustments, while interfacing with other ECU modules like Intake, Lambda, and Combustion Management.",
    "42_FULP-Fuel_low_pressure_supply": "This document specifies the Fuel Low Pressure (FULP) control module for the VW SIMOS 18.1 engine control unit (EA888 engine), which regulates the electrical fuel pump (EFP) using a PWM signal to maintain a target fuel pressure. The system employs adaptive control strategies, including \"Wobbel adaptation\" and PI adaptation, to adjust pump operation based on system deviation. A key technical feature is a protection function that inhibits battery voltage decrease during vehicle recuperation by calculating a dynamic voltage threshold based on engine speed and the EFP PWM signal, ensuring sufficient pump performance.",
    "43_FUSL-Fuel_supply": "This technical specification describes the FUSL (Fuel Supply) software module for the VW SIMOS 18.1 EA888 engine control unit, detailing its configuration, adaptation, and modeling functions. Core concepts include the control of high-pressure (HPP) and electric fuel pumps (EFP), determination of fuel pressure setpoints based on engine speed and mass air flow, and the configuration of injection modes for Direct Injection (DI), Multi-Port Injection (MPI), or mixed systems. The document specifies parameters for system diagnostics, adaptation algorithms for components like the Volume Control Valve (VCV), and a detailed model for calculating fuel temperature (TFU) across various engine operating states, including pull (PU) and pull fuel cut-off (PUC).",
    "44_FUTL-Fuel_tank_level": "This technical document describes the FUTL (Fuel Tank Level) software aggregate within the VW SIMOS 18.1 engine control unit. Its core purpose is to process fuel level sensor data, received via CAN or direct PIN inputs, for systems with one or two sensors (e.g., saddle tanks). The system's key functions include calculating the filtered fuel volume, determining the reserve fuel signal, detecting refueling and defueling events, and monitoring the filler cap status. It also performs functional diagnostics by checking sensor plausibility, detecting stuck signals, and comparing fuel level changes against calculated engine fuel consumption to identify errors.",
    "45_GEOL-Garage_End_Of_Line": "This technical document specifies the Garage End Of Line (GEOL) functionality for the Volkswagen (VW) SIMOS 18.1 EA888 engine control unit (ECU). It details the configuration data used to activate and manage GEOL features, including actuator adaptation, transmission tests, and interfaces with the error manager (ERRM). The specification outlines procedures for testing specific actuators like the wastegate and cooling fan, calculating EOL-specific error flags, and performing a \"Quick Sleep Current Measurement\" (QSCM) to verify the ECU's standby current draw using power latch (PWL) conditions.",
    "46_HVAC-Heating,_Ventilation_and_Air_Conditioning": "This technical document specifies the software logic within the VW SIMOS 18.1 Engine Control Unit (ECU) for managing the Heating, Ventilation, and Air Conditioning (HVAC) compressor on the EA888 engine. Its core function is to determine engine torque loss from the AC system by processing either refrigerant pressure (ACP_CAN) or a direct torque value (TQ_ACC_CAN) from the CAN bus, and to control the compressor's activation. The logic defines specific conditions for deactivating or reducing compressor power, such as full-load acceleration, high coolant temperature, low ambient pressure (altitude), and override commands from other vehicle control units.",
    "47_IGRE-Ignition_realisation": "This document describes the IGRE (Ignition Realisation) software aggregate for the VW SIMOS 18.1 EA888 engine control unit, focusing on its core purpose of calculating and controlling ignition coil dwell time and spark timing. The system determines the precise ON/OFF switching for the coil's power stage to generate a spark at a requested ignition angle, considering factors like engine speed and battery voltage. Key technical functions include the ability to deliver single or multiple sparks, a limp-home mode for operation during camshaft sensor failure by switching to a half-static mode, and comprehensive diagnostics for electrical faults in the ignition outputs, such as open circuits and short circuits to ground or power.",
    "48_IGSP-Ignition_angle_setpoint": "This technical document specifies the Ignition Angle Setpoint (IGSP) aggregate for the Continental VW SIMOS 18.1 EA888, a torque-based Engine Management System (EMS). The core purpose of the IGSP is to calculate the final ignition angle for each engine cylinder by calculating three key structural angles?Basic (BAS), Reference (REF) for optimal torque, and Minimum (MIN) for combustion stability. It then coordinates these values with requests from the torque manager and applies various corrections (e.g., temperature) to determine the final applied ignition angle (IGA_AV), considering different operational modes like engine start, homogenous, and stratified combustion for DI and MPI systems.",
    "49_IMMO-Immobilizer": "This technical document specifies the configuration, data definitions, and callable actions (API) for the Immobilizer (IMMO) software module within the Continental VW SIMOS 18.1 EA888 engine control unit. It details numerous configuration parameters for adapting the immobilizer to various engine types (combustion, hybrid), communication media (CAN, FR), non-volatile memory (NVM) hardware like Flash or EEPROM, and specific vehicle platforms. The specification also describes the module's functions for managing security, authentication, diagnostic communication, and retrieving data like P-Class and VIN.",
    "4_ALFU-Alternative_fuel": "This document describes the ALFU (Aggregate Alternative Fuel) function for the VW SIMOS 18.1 engine control unit, designed to manage alternative fuels like Compressed Natural Gas (CNG) and FlexFuel (ethanol-gasoline blends). Its core purpose is to determine the current fuel composition, represented by the variable `FAC_AFU_RATIO`, to adjust engine parameters. For FlexFuel systems without a physical ethanol sensor, the document details a multi-stage calculation strategy triggered by refueling, which uses engine roughness for initial adaptation (`Engine Running Adaptation`) and lambda sensor feedback for precise ethanol content determination (`Lambda based flex fuel ratio detection`). The alternative method, for systems equipped with an ethanol sensor, involves direct measurement of the fuel's ethanol content.",
    "50_INJR-Injection_realisation": "This technical document details the INJR (INJection Realisation) software aggregate for the VW SIMOS 18.1 engine control system, which functions as an inverse model of the fuel injection valve. Its core purpose is to calculate the precise injection time and phasing required to deliver a requested fuel mass, accounting for variables like fuel pressure and temperature. The system supports dual injection (MPI and HPDI) with multi-pulse strategies. A key technical concept is COSI (Controlled Solenoid Injection), a control function that uses voltage feedback to measure the actual injector closing time and adaptively adjust \"working curves\" for greater accuracy. The document also covers injection pulse collision management, cylinder activation/deactivation, and electrical diagnostics for the injection system.",
    "51_INSY-Intake_System": "This technical document describes the Intake System (INSY) for the VW SIMOS 18.1 EA888 engine control unit, whose core purpose is to predict the air mass flow into the cylinder for accurate fuel injection timing calculation. It utilizes a physical Intake Manifold Model (IMM) based on mass conservation and ideal gas laws to calculate a predicted manifold pressure (MAP_PRED) for the moment of intake valve closure, compensating for the dynamic filling characteristics of the manifold during transient engine operation. The model integrates inputs from the throttle, MAF/MAP sensors, Exhaust Gas Recirculation (EGR), canister purge (CPS), and crankcase ventilation systems, relying on key concepts like volumetric efficiency and partial pressure calculations.",
    "52_INTC-Intersystem_communication": "This document is a Software Requirement Specification for a CAN \"Bus Off\" handler module designed for an automotive ECU (VW SIMOS 18.1). Its core purpose is to define a system for managing and recovering from a Bus Off state on the Controller Area Network, where a node can no longer send or receive frames. The key technical concept is a configurable, two-level recovery algorithm that first attempts fast reconnections and then slower reconnections before entering a \"Bus locked\" state. The document details the state machine, algorithms, and a complete software API for initialization, configuration (timers, retry counts), cyclical execution, and interfacing with lower-level CAN drivers and upper-level error management layers.",
    "53_KNCK-Knock": "This technical document specifies the configuration and signal processing for the KNCK (Knock) function within the Continental VW SIMOS 18.1 ECU, specifically for EA888 engines. It details the extensive configuration parameters for the knock detection system, including the mapping of knock sensors to engine cylinders, setting sampling frequencies, and defining digital filter properties. The core technical process involves acquiring raw combustion noise signals within precisely timed, crankshaft-angle-based \"knock windows,\" then using software-based, multi-frequency band-pass filtering and integration to process the signal and calculate a final knock intensity value (KNKS) for each cylinder.",
    "54_LACO-Lambda_control": "This document details the LACO (Lambda Control) aggregate for the VW SIMOS 18.1 EA888 engine control system, which manages the air-fuel ratio. Its core functions include primary lambda control using an upstream oxygen sensor signal and trim control via a downstream sensor to maintain catalyst efficiency. The system implements multi-point lambda adaptation, using additive and multiplicative corrections to compensate for component tolerances and aging, with special routines for warm-up phases and for adapting the characteristic line of WRAF sensors. It also includes a comprehensive fuel system monitoring and diagnosis function to detect failures by checking adaptation and controller limits for MIL relevance. The document outlines two system variants (`bin/bin` and `lin/bin`), with the latter including advanced features like feed-forward control and sensor delay modeling.",
    "55_LASP-Lambda_setpoint": "This document describes the \"LAmbda SetPoint\" (LASP) function for the VW SIMOS 18.1 EA888 gasoline engine management system. Its core purpose is to calculate and coordinate multiple lambda requirements to determine a final, bank-selective lambda setpoint (`LAMB_SP`). The system calculates a basic lambda setpoint (`LAMB_BAS`) based on engine load and speed, then uses a \"Lambda Coordination\" module to arbitrate this value with other prioritized requests. Key technical concepts include adjustments for component overheating protection (`LAMB_OHP`), catalyst heat-up, NOx trap regeneration, and a critical function to increase the lambda setpoint during single cylinder fuel shut off (`LAMB_SCC`) to prevent catalyst damage.",
    "56_MCPC-Measurement_and_Calibration_Protocol_Communication": "This document details the Measurement and Calibration Protocol Communication (MCPC) for the VW SIMOS 18.1 EA888 engine control unit (ECU). It describes the configuration and function of different application systems used for visualizing internal data (measurement) and modifying parameters (calibration), primarily focusing on the ETK interface using the DISTAB13 protocol and the CAN Calibration Protocol (CCP). The document outlines the ECU's startup logic, which selects the active communication system based on hardware detection (e.g., ETK-S, TC1797ED microcontroller) and stored settings, configuring communication over either a dedicated calibration CAN bus (CAL-CAN) or the vehicle's powertrain CAN (PT-CAN). Key technical concepts covered include data acquisition (DAQ) lists, memory management (working/reference pages), flashing procedures, and the CAL-Wakeup feature.",
    "57_MISC-Miscellaneous": "This technical document serves as a data dictionary for the VW SIMOS 18.1 EA888 engine control unit, specifically defining the initialization of miscellaneous software variables and signals. It details numerous parameters related to core engine control, diagnostics, and vehicle systems, providing their names, coded and display limits, resolution, and units. Key technical concepts covered include CAN bus communication signals for modules like TCS and TCU, engine parameters such as ignition angle (?CRK), lambda/air-fuel ratio, torque factors, vehicle acceleration, and specific diagnostic test values for OBD Mode 06h related to systems like crankcase ventilation and camshaft adaptation.",
    "58_MISF-Misfire_monitoring": "This document details the MISF (Misfire Monitoring) software aggregate for the VW SIMOS 18.1 engine control system, designed to detect engine misfires in compliance with legal emissions standards, specifically CARB A, B1, and B4 criteria. The core function relies on analyzing an \"engine roughness index,\" derived from crankshaft speed fluctuations, to identify misfire events against calibrated thresholds. Key technical concepts include using \"fade-out\" conditions to prevent false detections caused by external factors like rough roads or drivetrain oscillations. The system's architecture determines misfire rates over specific crankshaft revolution intervals, identifies failing cylinders, and provides aggregated diagnostic information to the Error Management (ERRM) system for managing the MIL and corresponding error codes.",
    "59_NETM-Network_management": "This document specifies the Network Management (NETM) module for the VW SIMOS 18.1 EA888 Engine Control Unit, focusing on the configuration and application logic for managing the CAN bus communication state. It details the configurable timing parameters for the NM-High (NWM_H) driver, such as message cycle times, sleep/wakeup delays, and bus-off recovery. The core functionality is implemented as a state machine that transitions the ECU between Normal, Power-Latch (PWL), Ready Sleep, and Sleep modes by controlling the CAN transceiver based on various system inputs, wakeup events, and defined actions to ensure proper entry and exit from low-power states.",
    "5_ARSD-Acquisition_and_Reporting_of_Statistical_Data": "This technical document specifies the ARSD (Acquisition and Reporting of Statistical Data) system for the VW SIMOS 18.1 EA888 engine control unit (ECU), a configurable data recorder for collecting diagnostic histogram data (StatFunc, OBDS). The core purpose is to ensure data integrity using a cyclic redundancy check (CRC) on statistical counters stored in non-volatile memory (NVMY) between ECU power cycles. The system details the logic for data validation at power-up, freezing counters if calibration changes, and saving data at power-down, utilizing a trigger-based mechanism to capture events into class counters and FIFO histories based on extensive calibration parameters.",
    "60_OBDC-On-Board_diagnostic_communication": "This technical document specifies the On-Board Diagnostic Communication (OBDC) functionality for the VW SIMOS 18.1 EA888 engine control unit, adhering to ISO 15031-5 and SAE J1979 standards. Its core purpose is to define the implementation of emission-related diagnostic services (SIDs) that allow an external scan tool to request current data (SID 01h), freeze frames (02h), Diagnostic Trouble Codes (03h, 07h, 0Ah), vehicle information (09h), and to clear diagnostic data (04h). The document also details the configuration of these services and related components, such as oxygen sensors and EVAP systems, through specific calibration data and describes the software's OBDC service interpreter which processes these diagnostic requests, including a gateway for UDS services.",
    "61_OSYM-Operating_System_Monitoring": "This document describes the OSYM (Operating System Monitoring) software package, a configurable diagnostic and development tool for embedded systems like the VW SIMOS 18.1 ECU. Its core purpose is to provide runtime insight into the operating system's state by monitoring critical parameters such as worst-case stack usage (using a \"drag indicator\" pattern-fill mechanism) and tracking lost task activations to identify system overloads. The OSYM package also extends OS functionality with a Periodic Task Activator (PTA), a Message Passing mechanism (MEPA), time monitoring, and critical section protection, with features managed through configuration switches and data logged to Non-Volatile Memory.",
    "62_PSGP-Passenger_protection": "This technical document details the crash signal handling and diagnosis function for the Continental VW SIMOS 18.1 engine control unit (ECU) on the EA888 engine. Its core purpose is to receive a crash signal from the Airbag controller via CAN bus, set logical flags (`LV_CRASH`, `LV_CRASH_EFP_OFF`) to disable critical systems like the electric fuel pump, ignition, and injection, and store this state in non-volatile memory (EEPROM). The document also specifies the logic for monitoring engine state and handling restart requests post-crash, as well as the diagnostic procedures for detecting, debouncing, and storing errors related to the crash signal itself.",
    "63_PTQM-Powertrain_torque_management": "This technical document specifies the Powertrain Torque Management (PTQM) function for the VW SIMOS 18.1 engine control unit on EA888 engines. The core purpose is to calculate and coordinate various powertrain torque values, featuring distinct logic for combustion-only versus hybrid systems. Key concepts described include adapting the final driver torque request based on inputs like the accelerator pedal and cruise control, detecting a \"passive\" driver request (near minimum torque) to enable functions like fuel cut-off, calculating the actual static (TQ_AV) and effective (TQE) torque at the clutch by factoring in engine output, inertia, and torque losses from auxiliaries (alternator, A/C, power steering).",
    "64_PWSL-Power_Supply": "This technical document specifies the Power Supply (PWSL) aggregate for the VW SIMOS 18.1 EA888 engine management system (EMS). Its core purpose is to compute a single system battery voltage (VP_PWR) from various inputs (like VBK/KL15 and VBR/KL87), control the main power relay for actuators and sensors based on ECU state, and determine stable ignition key (KL15) and starter (KL50) states from filtered signals. The document also details the system's diagnostic capabilities, including checks for battery voltage thresholds and main relay faults, and provides an extensive list of configuration parameters (NC_ and NLC_ variables) for customizing these power management and diagnostic functions.",
    "65_SAIR-Secondary_air": "This technical document details the software function module for the Secondary Air (SAIR) system within the VW SIMOS 18.1 EA888 engine control unit. Its primary purpose is the configuration, adaptation, and diagnostics of the secondary air injection hardware. The module performs multi-phase diagnostics using key parameters such as secondary air pressure (`PRS_SA`) and relative air mass (`MASS_SA_REL`) to detect leaks, perform plausibility checks, and evaluate overall system health. It defines hardware configurations like pumps and banks, calculates diagnostic values for OBD-II scan tool reporting (`$Mode06`), and manages the conditions for activating or disabling the diagnostic functions.",
    "66_STSY-Steering_system": "This technical document describes the STSY (Steering System) function within the VW SIMOS 18.1 EA888 control unit, which calculates the power steering system's torque load on the engine (`TQ_LOSS_PSTE`) and a corresponding engine torque reserve (`TQ_ADD_PSTE`). The system processes inputs from PSTE and SCU modules via CAN, such as steering angle, gradient, and acceleration, along with vehicle and engine speed. It utilizes extensive configurable calibration data, including breakpoints and lookup tables (maps), to determine both the quasi-static pump losses and the dynamic torque required during active steering maneuvers to maintain engine stability.",
    "67_SUSY-Suspension_system": "This technical document specifies the SUSY (Suspension System) function within the Continental SIMOS 18.1 engine control unit for VW EA888 engines. The function's core purpose is to control the stiffness of Active Engine Brackets (AEB) and Active Transmission Brackets (ATB) for vehicle comfort. It determines the activation of these components based on configurable conditions such as engine speed, vehicle speed, engine start/stop events, and engine load. Key technical concepts include the configuration of the number of active brackets based on vehicle type, calibration of activation thresholds, and the use of a master control byte, `C_CONF_AEB_ATB_CTL`, to enable or disable specific control sub-functions.",
    "68_SYCF-System_Configuration": "This document is a technical specification detailing the system configuration (SYCF) data for the Continental SIMOS 18.1 Engine Control Unit (ECU) designed for the VW EA888 engine. It lists a comprehensive set of configurable parameters, compiler switches, and coded values used to define the ECU's software behavior. The parameters govern a wide range of functionalities, including engine control, powertrain type, diagnostics (UDS), CAN communication, and memory block definitions for software flashing (ODX containers), enabling the adaptation of the ECU software for various vehicle and hardware configurations.",
    "69_THRO-Throttle": "This technical document specifies the THRO (Throttle) software module for the VW SIMOS 18.1 engine control unit, designed to manage the electronic throttle control (ETC) actuator in a drive-by-wire system. The core purpose is to implement a closed-loop digital position controller that adjusts the throttle flap based on setpoints derived from driver requests and engine operating states. The module also integrates extensive level 1 diagnosis functions for the position sensors, actuator, and H-bridge power stage, all overseen by a central limp-home management system that can initiate fault reactions, such as power stage deactivation or engine torque reduction, in response to critical errors.",
    "6_BRSY-Braking_system": "This document describes the BRSY (Braking System) software aggregate for the VW SIMOS 18.1 engine control unit. The system's core function is to monitor the vacuum pressure in the Brake Servo Unit (BSU) to ensure sufficient power for safe braking. If the vacuum is insufficient, the BRSY module initiates corrective actions, such as requesting an engine restart for Stop/Start functionality, altering engine control to build vacuum, and inhibiting other vehicle systems like Adaptive Cruise Control (ACC) or Exhaust Gas Recirculation (EGR). The document focuses on the system's architecture, operational logic, and extensive configuration and calibration data, including compiler switches, pressure thresholds, and timing delays for these interventions.",
    "70_TQDR-Torque_determination_and_realization": "This technical document describes the TQDR (Torque Determination and Realization) software aggregate for the Continental SIMOS 18.1 engine control unit used in VW EA888 engines. The core function of TQDR is to manage engine output through a central torque model. This model operates bidirectionally: a \"reverse\" path calculates actuator setpoints (e.g., ignition angle, mass air flow, fuel mass) to achieve a desired torque, while a \"forward\" path calculates the actual indicated and effective engine torque from current operating parameters. The system, which supports HPDI and MPI systems with homogeneous and stratified combustion modes, also determines the engine's minimum and maximum torque capabilities by calculating various efficiencies (e.g., `EFF_IGA`, `EFF_LAMB`, `EFF_EGR`) that quantify the torque impact of different engine parameters.",
    "71_TQLO-Torque_losses": "This technical document describes the TQLO (Torque Losses) aggregate function for the VW SIMOS 18.1 EA888 engine control system, which calculates the engine's total torque losses. The system sums engine-immanent friction and pumping losses, losses from auxiliary components like the A/C compressor, and project-specific corrections, while excluding gearbox and powertrain losses. A key technical concept is the idle speed adaptation algorithm, which compensates for deviations from aging or production tolerances by using the idle speed controller's integral part under specific, controlled conditions. The final calculated torque loss value is used for engine management and to provide a filtered value to the clutch system to prevent torque jerks.",
    "72_TQSP-Torque_setpoint": "This technical document specifies the TQSP (Torque Setpoint) module for the Continental SIMOS 18.1 Engine Control Unit (ECU) designed for the VW EA888 engine. Its core purpose is to manage, coordinate, and limit engine torque based on a wide range of inputs and protective strategies. The document details the extensive set of configuration data and compiler switches used to enable, disable, and calibrate functionalities such as dynamic torque intervention, torque reserves, and various limitations for combustion control (e.g., over-boost, temperature de-rating) and engine component protection (e.g., oil pump failure). Key concepts include the coordination of multiple torque requests, adaptation of signals for fast and slow torque paths, and the definition of full-load torque curves for different transmission types.",
    "73_TRSM-Transmission": "This document specifies the TRSM (Transmission) software aggregate for the VW SIMOS 18.1 engine control unit, designed to centralize functionalities for various configurable transmission types, including Manual (MT), Automatic (AT), Dual-Clutch (DCT), and CVT. Its core purpose is to determine transmission status?such as gear ratio, clutch switch state, and park/neutral signals?which provides critical input for engine management functions like Stop/Start, starter interlock, and torque control for smooth gear shifting. The module also performs extensive diagnostic routines for transmission sensors and switches, and the document details its software configuration parameters, calibration data, and synchronization constraints with other ECU modules.",
    "74_VHMD-Vehicle_motion_determination": "This technical document details the Vehicle Motion Determination (VHMD) function for the VW SIMOS 18.1 EA888 engine control unit, focusing on acquiring and processing signals from hardwired vehicle speed sensors. It outlines the system's configuration parameters, including settings for sensor inputs, buffer sizes, and various diagnostic routines. The core technical process involves an event-driven measurement of sensor pulse periods, using a speed-adaptive pulse division factor to manage ECU load. These measurements are buffered to calculate a mean segment time (`T_SEG_VS_MV`), which is the basis for the final vehicle speed calculation, with a watchdog timer implemented to ensure signal validity and handle sensor failure or standstill conditions.",
    "75_VHSC-Vehicle_speed_control": "This technical specification details the Vehicle Speed Control (VHSC) function for the VW SIMOS 18.1 EA888 engine control unit. The document focuses on two main areas: system configuration and diagnostics for cruise control and the variable vehicle speed limiter. It provides comprehensive lists of configuration flags, calibration data, and diagnostic variables used to define system behavior, such as enabling torque-based adaptive cruise control (DCC) or interfacing with brake and ESP systems. The diagnostics section outlines parameters for fault detection, including error symptoms, debouncing timers, and plausibility checks for numerous diagnostic instances related to acceleration, brake signals, and CAN communication.",
    "76_VHSL-Vehicle_speed_limitation": "This technical specification document details the Vehicle Speed Limitation (VHSL) function for the Continental SIMOS 18.1 engine control unit on the VW EA888 platform. The core purpose is to limit vehicle speed by calculating a maximum engine and wheel torque request (TQ_VS_MAX, TQ_WHL_VS_MAX) based on various inputs and modes, including permanent (PVSL), variable (VVSL), customer-settable, high-temperature, and system-error conditions from ESP or 4WD controllers. The document outlines configuration flags, extensive calibration parameters, reversible/irreversible deactivation logic (e.g., for kickdown), and the critical use of redundant non-volatile memory (NVM) channels to ensure limit values persist through power cycles and software updates.",
    "77_VHST-Vehicle_stability_and_traction": "This technical document describes the VHST (VeHicle Stability and Traction control) software aggregate for the VW SIMOS 18.1 engine controller. Its core purpose is to manage, enable, and diagnose torque intervention requests received via CAN from the Electronic Stability Control (ESC) system. The document details two key interventions: ASR (Antriebsschlupfregelung), which reduces engine torque to prevent wheel spin, and MSR (Motorschleppmomentregelung), which increases engine torque to prevent wheel slip from engine braking. A significant portion focuses on the system's diagnostic functions, which perform plausibility checks on ASR/MSR requests to detect errors, interrupt invalid interventions, and store fault codes.",
    "78_VVLI-Variable_Valve_Lift": "This technical document details the Variable Valve Lift (VVLI) software function for the VW SIMOS 18.1 EA888 engine management system. Its core purpose is to coordinate and control the switching between different inlet/outlet valve lift profiles based primarily on engine torque request, speed, and air mass. The system uses a modular software architecture to determine the switch timing and target crankshaft position for controlling electromechanical actuators, compensating for variables like temperature and voltage. Key technical concepts include a state machine for managing transitions, a diagnostic function that confirms successful switching by analyzing induced voltage feedback from the actuator pin, and a limp-home manager to handle detected failures.",
    "79_VVTI-Variable_Valve_Timing": "This document details the Variable Valve Timing (VVTI) system within the VW SIMOS 18.1 engine control unit for the EA888 engine, designed to dynamically adjust the phasing of inlet and exhaust camshafts. The core purpose is to optimize engine performance, fuel efficiency, and emissions by controlling valve timing based on the engine's operating state. The system utilizes an oil-pressure actuator managed by a PWM-controlled solenoid valve to match a calculated position \"setpoint.\" Key technical concepts include a control strategy combining Pre-control (feed-forward) and P-control (feedback) with adaptive holding duty cycle, leveraging gas dynamics (ram/wave effects) to improve volumetric efficiency, enabling internal exhaust gas recirculation (EGR), and implementing comprehensive system diagnostics for faults and performance deviations.",
    "7_CBMD-Combustion_modes": "This document describes the CBMD (Combustion Mode Manager) software module for the VW SIMOS 18.1 EA888 engine control unit. Its core purpose is to centrally manage, prioritize, and control transitions between various engine combustion modes, including multi-pulse, stratified, homogeneous, and mixed MPI/HPDI operations. The system uses a priority-based request architecture where different ECU functions (e.g., catalyst heating, torque model, diagnostics) request specific behaviors. CBMD arbitrates these requests, selects the highest-priority valid mode, and manages the setpoints for fuel injection, ignition, and lambda, while also handling numerous configurable inhibit conditions based on engine state.",
    "80_Appendix": "This document specifies the software data naming convention for the VW SIMOS 18.1 EA888 engine management system. It details the syntax rules for creating data names and describes a structured building rule where names are composed by concatenating keywords from five classes: Structure, Physical meaning, Dependency, Component/Function, and Characteristic. The document also provides an extensive keyword list defining the technical abbreviations and acronyms (e.g., ECU, CAN, EGR, VVT) used for variables, functions, and components within the system's software and documentation.",
    "8_CEVC-Crankcase_evaporation_control": "This technical document specifies the Crankcase Evaporation Control (CEVC) software function for the VW SIMOS 18.1 EA888 engine control unit. The core of this system is a detailed oil dilution model that calculates the mass of fuel accumulating in and evaporating from the engine oil, defined by top (TOL) and bottom (BOL) limits. This model utilizes numerous configuration parameters and calibration data to weigh the influence of key engine operating conditions?such as coolant/oil temperature, engine speed, mass air flow, and pressure?on fuel-in-oil calculations. The function's primary outputs are the integrated mass of fuel in oil, the fuel mass flow rate into or out of the oil, and a predicted lambda correction value, which are used for engine control adjustments and can trigger a warning for high oil dilution.",
    "9_CHRA-Charger_actuators": "This technical document specifies the CHRA (Charger Actuators) software aggregate for the Continental SIMOS 18.1 engine control unit used in the VW EA888 engine. The core purpose of this module is to configure and control turbocharger actuators?including wastegates, variable geometry turbines (VTG), and recirculation valves?to manage engine boost pressure. It details the distinct control strategies for both electrical actuators, which use closed-loop position control with a position sensor, and pneumatic actuators, which are controlled via open-loop PWM signals to an electropneumatic converter (EPC). Key concepts include the use of configuration constants (NC_xxx parameters) to define the hardware layout (actuator type, number of sensors), diagnostic functions, safety limitations, and the modeling of pneumatic wastegate pressure for systems lacking a direct sensor.",
    "BinToolz.docx": "This document is a user guide for BinToolz, a software application for modifying automotive ECU and DSG binary firmware files (.bin). The core purpose of the tool is to manage calibration data and apply \"One Click Patches.\" It explains how to use CAL Tools to extract or insert the calibration block (block 5) from a full bin file and how to use the patching feature to add functionalities and safeguards such as High Speed Logging (HSL), CBrick (anti-brick protection), SwitchPatch (for map switching, launch control, flex fuel), Simple Wastegate (SWG), and a DSG Torque Patch.",
    "Cover_page": "This document is a technical specification for the VW SIMOS 18.1 Engine Management System, designed for the EA888 engine platform. The specific project is for customer Audi and pertains to software version SC8L50Y0, as of November 10, 2014.",
    "Flex Tuning_Switchpatch.docx": "This document details the process for configuring flex-fuel tuning on an Engine Control Unit (ECU) using the \"Switchpatch\" software. It explains how to use an ethanol sensor's real-time readings to dynamically alter engine parameters through \"flex modifiers.\" The core technical concepts covered include setting up the \"Flex Fuel Weight Axis\" to scale adjustments based on ethanol percentage, applying positive or negative values in modifier tables to change base maps for spark timing, boost (PUT), and lambda, and enabling these flex features individually for different map slots within the Switchpatch.",
    "Global_Data_Index": "This document is a global data index for the Continental SIMOS 18.1 Engine Control Unit (ECU) software, designed for the Volkswagen (VW) EA888 engine. It serves as a technical reference, providing an alphabetical list of software parameters, variables, and diagnostic flags. The indexed items cover core engine management and diagnostic functions, including signals from crankshaft (CRK) and camshaft (CAM) sensors, knock detection (KNK), CAN bus monitoring, and various electrical fault codes such as short circuits (SCG/SCP) and open circuits (OC), mapping each item to its definition and usage locations within the project documentation.",
    "How_to_update_dongle_firmware": "This document provides a step-by-step guide on how to update the firmware for an SL1/A0 automotive dongle running the \"esp32-isotp-ble-bridge\" software for VAG products. The core process involves first installing the Silicon Labs CP210x USB to UART bridge driver to establish a COM port connection, then uninstalling the old firmware version, installing the new .msi file from Github, and finally using a dedicated setup application to flash the new firmware. A key technical step in the flashing process requires putting the device into a programming mode by holding down a physical button while initiating the update via the software.",
    "Launch Control Guide": "This technical guide explains the setup and tuning of OEM and custom launch control logic for vehicles by modifying ECU and TCU calibrations. It contrasts multiple methods, focusing on 'slow path intervention' (throttle closure) and 'fast path intervention,' which uses ignition retard and Single Cylinder Cutoff (SCC) to manage engine RPM and build boost. The document details configurations for DSG-only OEM logic and the alternative SwitchPatch LC system (for MT and DSG), providing guidance on adjusting specific ECU tables (e.g., `CordTqIntv`), TCU bitmasks, and parameters for spark, SCC, and boost to achieve desired launch performance.",
    "Simos Tools  ECU Unlock Guide.docx": "This technical document provides a step-by-step guide for unlocking a vehicle's Engine Control Unit (ECU) using the Simos Tools mobile application and a corresponding OBD dongle. The core process involves connecting the hardware, verifying ECU information, selecting a correct `.bin` firmware file, and initiating the unlock/flash procedure through the app. The guide covers the entire process from initial setup to flashing completion and includes key troubleshooting steps for failed flashes, such as adjusting the \"ECU STMIN\" setting or capturing debug logs.",
    "SwitchpaTCh Traction Control.docx": "This document describes SwitchpaTC, a custom traction control system for MK7/MK7.5 vehicles that replaces the stock brake-based system. Its core purpose is to manage wheelspin by proactively modulating engine power via ignition timing reduction and boost cuts (wastegate control). The system is highly configurable through the ECU, allowing users to define wheel slip targets and adjust intervention using a PID controller with parameters for ignition/wastegate weights, spark cut thresholds, and safety limits. This functionality is integrated with mapswitching, enabling different traction control settings per map.",
    "Table_of_contents": "This technical document is a software specification for the Continental SIMOS 18.1 engine control unit (ECU) designed for the Volkswagen EA888 engine. It details the architecture and functionality of numerous software modules responsible for engine management, including air motion control (AIRM) with port flaps, air temperature modeling and sensing (AIRT), turbocharger and boost pressure control (CHRA, CHRG), alternative/flex fuel management for ethanol (ALFU), and combustion mode switching (CBMD). The document also covers system integration, actuator control logic, sensor data acquisition, comprehensive diagnostics for all components, and diagnostic communication protocols like UDS.",
    "web_Volkswagen+MQB+Tuning+Guide": "This document is a COBB tuning guide for Volkswagen and Audi vehicles on the MQB platform, such as the MK7 GTI and Golf R. It explains that the 2.0T engine utilizes a MAP-based (Manifold Absolute Pressure) airflow system and a torque-based boost control strategy. The core tuning concept involves indirectly controlling boost by manipulating tables that define the engine's requested torque (e.g., \"Maximum Torque Manual/Automatic\"). Increasing the requested torque causes the ECU to calculate a higher mass airflow target and subsequently raise the boost pressure to achieve the new, higher engine load and power output.",
    "web_VW+Reference+Torque+Set+Point+Calculations": "This document describes the Volkswagen (VW) Reference Torque Set Point calculation, a system designed to accurately report engine torque output. It functions by comparing the final Base ignition timing against an optimal Reference ignition timing table to generate a difference value (IGA_DIF). This value is then translated into an \"Ignition Torque SP Efficiency,\" which is multiplied by the \"Reference Indicated Torque\" map. The core purpose of this entire process is to correct the reported torque value to ensure it is an accurate representation of the motor's actual output.",
    "web_VW+AG+EA888+Engine+Tuning": "This technical document provides a reference for tuning the Volkswagen AG EA888 Gen 3 engine, specifically for vehicles on the MQB and MLB platforms, such as the VW Golf and Audi A3, which use a Simos 18 Engine Control Unit (ECU). The content primarily serves as an extensive glossary, defining a wide range of automotive and ECU tuning terminology. It covers general concepts like Air Fuel Ratio (AFR) and Direct Injection (DI), VAG-specific systems like DSG and AVS, and proprietary features from EcuTek tuning software, including RaceROM, Map Switching, and Custom Maps.",
    "web_EA888+Multi-Port+Injection": "This technical document details the configuration of the EA888 engine's Multi-Port Injection (MPI) system, focusing on setting torque and Mass Air Flow (MAF) thresholds to control the transition between different fuel injection modes, such as MPI only, Direct Injection (DI), and combined DI + MPI. It describes adjustable parameters like torque limits and hysteresis for various combustion modes. The document also serves as an extensive glossary, defining numerous automotive ECU tuning acronyms and concepts, with specific references to EcuTek software and features like RaceROM.",
    "web_EA888+Low+Pressure+Fuel+Pump+LPFP+Control": "This document details the calibration and tuning process for the Low Pressure Fuel Pump (LPFP) control system on the EA888 engine platform. It explains how to manage the Fuel Pump Control Module (FPCM) to deliver the correct fuel pressure and flow, particularly after installing aftermarket pumps for high-power or ethanol-fueled applications. The core technical concepts covered include setting target pressures, adjusting feed-forward duty cycle maps, and tuning the Proportional, Integral, and Derivative (PID) components to maintain a stable, closed-loop fuel delivery system.",
    "web_VW+EA888+Combustion+Modes+Configuring+MPI": "This technical document details the combustion mode management system in VAG Simos ECUs for the VW EA888 engine, explaining how the ECU selects specific fueling and ignition strategies based on operating conditions. It outlines the core architecture involving Operating Points (OPP), selectable mode slots, priorities, and inhibit flags that determine the final injection strategy (e.g., DI, MPI, stratified, mixed). The document's primary focus is on the practical calibration process for tuners to enable and control mixed Multi-Port (MPI) and Direct Injection (DI) operation, specifically by remapping tables to activate a mixed mode like \"OPP_MPI_2\" under high engine load for performance tuning."
}